controllers/ProjectController.php

SELECT * FROM `project` WHERE `id`='3'
---
    public function actionEdit($id)
    {
        $model = new ProjectForm();

        $project = Project::findOne($id);

SELECT * FROM `project` WHERE `id`='3'
DELETE FROM `project` WHERE `id`=3
---
    public function actionDelete($id)
    {
        $project = Project::findOne($id);

        if ($project)
            $project->delete();