controllers/SiteController.php

    public function actionIndex()
    {
        $query = Project::find();

        $project = $query->orderBy('id')->all();
---
SELECT * FROM `project` ORDER BY `id`

    public function actionSearch()
    {
        $model = new Search();

        $status = Status::find()->select(['name', 'id'])->indexBy('id')->column();
---
SELECT `name`, `id` FROM `status`