controllers/TaskController.php

    public function actionIndex($id)
    {
        $project = Project::findOne($id);
---
SELECT * FROM `project` WHERE `id`='2'

    public function actionNew($id)
    {
        $model = new TaskForm();

        $status = Status::find()->select(['name', 'id'])->indexBy('id')->column();
---
SELECT `name`, `id` FROM `status`

    public function actionEdit($id)
    {
        $model = new TaskForm();
        $task = Task::findOne($id);

        $status = Status::find()->select(['name', 'id'])->indexBy('id')->column();
---
SELECT * FROM `task` WHERE `id`='4'
SELECT `name`, `id` FROM `status`

    public function actionDelete($id)
    {
        $task = Task::findOne($id);

        if ($task)
            $task->delete();
---
SELECT * FROM `task` WHERE `id`='7'
DELETE FROM `task` WHERE `id`=7