models/ProjectForm.php

INSERT INTO `project` (`name`) VALUES ('wdefrgthjuyhtgrfed')
---
    public function newProject()
    {
        if ($this->validate()) {
            $project = new Project();
            $project->name = $this->name;
            $project->save();

UPDATE `project` SET `name`='wde23123' WHERE `id`=3
---
    public function editProject($project)
    {
        if ($this->validate()) {
            $project->name = $this->name;
            $project->save();