models/Search.php

    public function newSearch()
    {
        $dbQuery = new Query();
        $query  = $dbQuery->select([
            'id' => 'task.id',
            'name' => 'task.name',
            'status' => 'status.name',
            'user' => 'user.name',
            'project' => 'project.name'
        ])->from('task')->
            join('LEFT JOIN', 'user', 'user.id = user_id')->
            join('LEFT JOIN', 'status', 'status.id = status_id')->
            join('LEFT JOIN', 'project', 'project.id = project_id')->
        where('task.name like :name', [':name' => "%" . $this->name . "%"])->
        andwhere(["=", "task.user_id", $user = Yii::$app->user->identity->id]);
---
SELECT `task`.`id` AS `id`, `task`.`name` AS `name`, `status`.`name` AS `status`, `user`.`name` AS `user` FROM `task` LEFT JOIN `user` ON user.id = user_id LEFT JOIN `status` ON status.id = status_id WHERE (task.name like '%rw%') AND (`task`.`user_id` = 2) ORDER BY `id` DESC