models/TaskForm.php

    public function newTask($id)
    {
        if ($this->validate()) {
            $task = new Task();
            $user = Yii::$app->user->identity;
            $task->name = $this->name;
            $task->project_id = $id;
            $task->status_id = $this->status_id;
            $task->user_id = $user['id'];
            $task->save();
---
INSERT INTO `task` (`name`, `project_id`, `status_id`, `user_id`) VALUES ('sw', 2, 1, 2)

    public function editTask($task)
    {
        if ($this->validate()) {
            $task->name = $this->name;
            $task->status_id = $this->status_id;
            $task->save();
---
UPDATE `task` SET `name`='swfse', `status_id`=1 WHERE `id`=4