models/User.php

    public static function findIdentity($id)
    {
        $user = self::findOne($id);
---
SELECT * FROM `user` WHERE `id`=2